// 1. открыть git bash
// 2. ввести команду "git clone https://github.com/nickcooldad/rocket.git"
// 3. выполнить "cd rocket"

// ls - проверка наличия файлов в папке
// cd name - переход вперед
// cd .. - назад

// git status - проверка статуса изменений
// git add -A - перевести в промежуточные изменения
// git commit -m "name commit" - закомитить изменения
// git push - загрузка изменений на github
// git pull - выгрузить изменения из хаба

// Регулярные выражения!
// . - любой одиночный символ
// [ ] - любой из них, диапазоны
// $ - конец строки
// ^ - начало строки
// \ - экранирование
// \d - любую цифру
// \D - все что угодно, кроме цифр
// \s - пробелы
// \S - все кроме пробелов
// \w - буква
// \W - все кроме букв
// \b - граница слова
// \B - не границ

// Квантификация
// n{4} - искать n подряд 4 раза
// n{4,6} - искать n от 4 до 6
// * от нуля и выше
// + от 1 и выше
// ? - нуль или 1 раз
